#include <iostream>
using namespace std;
/*
1.算术运算符
	+ - * / %
	++ 前置递增 b = ++a;
	++ 后置递增 b = a++;
	-- 前置递减 b = --a;
	-- 后置递减 b = a--;

2.赋值运算符
	=	+=	-=	*=	/=	%=

3.比较运算符
	==	!=	>=	<=	>	<

4.逻辑运算符
	!(取反)		&&（and）	||（or）

*/

int main() {
	// =================================================
	//1.前置递增：先加一 再参与运算
	int a = 10;
	++a;
	cout << "a = " << a << endl << endl;

	//2.后置递增：先参与运算 再加一
	int b = 10;
	b++;
	cout << "b = " << b << endl << endl;

	//3.前置递增和后置递增的区别
	int c1 = 10;
	int c2 = c1++;
	int c3 = ++c1;
	cout << "c1 = " << c1 << endl;
	cout << "c2 = " << c2 << endl;
	cout << "c3 = " << c3 << endl << endl;
	// 递减和递增一样道理
	
	// ================================================
	// 比较运算
	int d = 10;
	int e = 20;
	cout << "d == e:  " << (d == e) << endl << endl;
	
	// ================================================
	int f = 10;
	bool g = false;
	// !(取反)
	cout << "!f -> " << !f << endl;
	// &&（and）
	cout << "f&&(!g) -> " << (f&&(!g)) << endl;
	// ||（or）
	cout << "f||g -> " << (f||g) << endl << endl;

	return 0;
}
